name: "pytorch_model"
platform: "pytorch_libtorch"

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 224, 224] 
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [128] 
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU 
  }
]
