name: "vllm_sync"
backend: "python"
max_batch_size: 0

    input
[{
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ -1, 1 ]
}] output
[{
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1, 1 ]
}]

    instance_group
[{ 
    kind: KIND_GPU
}]

parameters: {
key:
    "EXECUTION_ENV_PATH", value: {
    string_value:
        "$$TRITON_MODEL_DIRECTORY/env.tar.gz"
    }
}

